assignment1/benchmarks/openstack/disk_benchmark_write_2017-06-14:21:53:19.out
write: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
write: Laying out IO file(s) (1 file(s) / 64MB)
write: Laying out IO file(s) (1 file(s) / 64MB)
write: Laying out IO file(s) (1 file(s) / 64MB)
[...]

write: (groupid=0, jobs=4): err= 0: pid=1680: Wed Jun 14 21:54:33 2017
  write: io=262144KB, bw=48708KB/s, iops=12176, runt=  5382msec
    clat (usec): min=3, max=208630, avg=322.51, stdev=6492.21
     lat (usec): min=3, max=208630, avg=323.68, stdev=6492.76
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    5], 95.00th=[    6],
     | 99.00th=[   17], 99.50th=[   47], 99.90th=[124416], 99.95th=[158720],
     | 99.99th=[189440]
    bw (KB  /s): min= 4187, max=19004, per=24.70%, avg=12032.64, stdev=3252.07
    lat (usec) : 4=0.01%, 10=98.36%, 20=0.81%, 50=0.34%, 100=0.03%
    lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.03%, 4=0.05%, 10=0.08%, 20=0.03%, 100=0.02%
    lat (msec) : 250=0.22%
  cpu          : usr=0.69%, sys=1.33%, ctx=336, majf=0, minf=46
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=262144KB, aggrb=48707KB/s, minb=48707KB/s, maxb=48707KB/s, mint=5382msec, maxt=5382msec

Disk stats (read/write):
  vda: ios=0/281, merge=0/42, ticks=0/102056, in_queue=104432, util=97.39%